In [3]:
import pandas as pd

In [2]:
!pip install pandas

^C

[notice] A new release of pip is available: 24.0 -> 24.1.2
[notice] To update, run: C:\Users\ASUS\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.10_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

Collecting pandas
  Downloading pandas-2.2.2-cp310-cp310-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.22.4 in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from pandas) (1.26.4)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from pandas) (2.8.2)
Collecting pytz>=2020.1 (from pandas)
  Downloading pytz-2024.1-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Downloading tzdata-2024.1-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\users\asus\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Downloading pandas-2.2.2-cp310-cp310-win_amd64.whl (11.6 MB)
   ---------------------------------------- 0.0/11.6 MB ? eta -:--:--
   ---------------------------------------- 0.1/11.6 MB 1.5 MB/s eta 0:00:08
    --------------------------------------- 0.2/11.6 MB 2.2 MB/s eta 0:00:06
   - -------------------------------------- 0.3/11.6 MB 2.3 MB/s eta 0:00:05
   - -------------------------------------- 0.5/11.6 MB 2.5 MB/s eta 0:00:05
   - -------------------------------------- 0.6/11.6 MB 2.4 MB/s eta 0:00:05
   -- ------------------------------------- 0.7/11.6 MB 2.5 MB/s eta 0:00:05
   -- ------------------------------------- 0.8/11.6 MB 2.5 MB/s eta 0:00:05
   --- ------------------------------------ 1.0/11.6 MB 2.5 MB/s eta 0:00:05
   --- ------------------------------------ 1.1/11.6 MB 2.5 MB/s eta 0:00:05
   ---- ----------------------------------- 1.2/11.6 MB 2.6 MB/s eta 0:00:05
   ---- ----------------------------------- 1.3/11.6 MB 2.6 MB/s eta 0:00:04
   ---- ----------------------------------- 1.4/11.6 MB 2.6 MB/s eta 0:00:04
   ----- ---------------------------------- 1.6/11.6 MB 2.6 MB/s eta 0:00:04
   ----- ---------------------------------- 1.7/11.6 MB 2.6 MB/s eta 0:00:04
   ------ --------------------------------- 1.8/11.6 MB 2.5 MB/s eta 0:00:04
   ------ --------------------------------- 1.9/11.6 MB 2.5 MB/s eta 0:00:04
   ------ --------------------------------- 2.0/11.6 MB 2.5 MB/s eta 0:00:04
   ------- -------------------------------- 2.1/11.6 MB 2.5 MB/s eta 0:00:04
   ------- -------------------------------- 2.2/11.6 MB 2.6 MB/s eta 0:00:04
   -------- ------------------------------- 2.4/11.6 MB 2.5 MB/s eta 0:00:04
   -------- ------------------------------- 2.5/11.6 MB 2.5 MB/s eta 0:00:04
   -------- ------------------------------- 2.6/11.6 MB 2.5 MB/s eta 0:00:04
   --------- ------------------------------ 2.7/11.6 MB 2.5 MB/s eta 0:00:04
   --------- ------------------------------ 2.8/11.6 MB 2.5 MB/s eta 0:00:04
   --------- ------------------------------ 2.9/11.6 MB 2.5 MB/s eta 0:00:04
   ---------- ----------------------------- 3.0/11.6 MB 2.5 MB/s eta 0:00:04
   ---------- ----------------------------- 3.1/11.6 MB 2.5 MB/s eta 0:00:04
   ----------- ---------------------------- 3.2/11.6 MB 2.5 MB/s eta 0:00:04
   ----------- ---------------------------- 3.3/11.6 MB 2.5 MB/s eta 0:00:04
   ----------- ---------------------------- 3.4/11.6 MB 2.5 MB/s eta 0:00:04
   ------------ --------------------------- 3.6/11.6 MB 2.5 MB/s eta 0:00:04
   ------------ --------------------------- 3.7/11.6 MB 2.5 MB/s eta 0:00:04
   ------------- -------------------------- 3.8/11.6 MB 2.5 MB/s eta 0:00:04
   ------------- -------------------------- 3.9/11.6 MB 2.5 MB/s eta 0:00:04
   ------------- -------------------------- 4.0/11.6 MB 2.5 MB/s eta 0:00:04
   -------------- ------------------------- 4.2/11.6 MB 2.5 MB/s eta 0:00:04
   -------------- ------------------------- 4.3/11.6 MB 2.5 MB/s eta 0:00:03
   --------------- ------------------------ 4.4/11.6 MB 2.5 MB/s eta 0:00:03
   --------------- ------------------------ 4.5/11.6 MB 2.5 MB/s eta 0:00:03
   ---------------- ----------------------- 4.6/11.6 MB 2.5 MB/s eta 0:00:03
   ---------------- ----------------------- 4.8/11.6 MB 2.5 MB/s eta 0:00:03
   ---------------- ----------------------- 4.9/11.6 MB 2.5 MB/s eta 0:00:03
   ----------------- ---------------------- 5.0/11.6 MB 2.5 MB/s eta 0:00:03
   ----------------- ---------------------- 5.2/11.6 MB 2.5 MB/s eta 0:00:03
   ------------------ --------------------- 5.3/11.6 MB 2.5 MB/s eta 0:00:03
   ------------------ --------------------- 5.4/11.6 MB 2.5 MB/s eta 0:00:03
   ------------------ --------------------- 5.5/11.6 MB 2.5 MB/s eta 0:00:03
   ------------------- -------------------- 5.6/11.6 MB 2.5 MB/s eta 0:00:03
   ------------------- -------------------- 5.8/11.6 MB 2.5 MB/s eta 0:00:03
   -------------------- ------------------- 5.9/11.6 MB 2.5 MB/s eta 0:00:03
   -------------------- ------------------- 6.0/11.6 MB 2.5 MB/s eta 0:00:03
   --------------------- ------------------ 6.1/11.6 MB 2.5 MB/s eta 0:00:03
   --------------------- ------------------ 6.2/11.6 MB 2.5 MB/s eta 0:00:03
   --------------------- ------------------ 6.3/11.6 MB 2.5 MB/s eta 0:00:03
   ---------------------- ----------------- 6.5/11.6 MB 2.5 MB/s eta 0:00:03
   ---------------------- ----------------- 6.6/11.6 MB 2.5 MB/s eta 0:00:02
   ----------------------- ---------------- 6.7/11.6 MB 2.5 MB/s eta 0:00:02
   ----------------------- ---------------- 6.8/11.6 MB 2.5 MB/s eta 0:00:02
   ----------------------- ---------------- 7.0/11.6 MB 2.5 MB/s eta 0:00:02
   ------------------------ --------------- 7.1/11.6 MB 2.5 MB/s eta 0:00:02
   ------------------------ --------------- 7.2/11.6 MB 2.5 MB/s eta 0:00:02
   ------------------------- -------------- 7.3/11.6 MB 2.5 MB/s eta 0:00:02
   ------------------------- -------------- 7.4/11.6 MB 2.5 MB/s eta 0:00:02
   ------------------------- -------------- 7.5/11.6 MB 2.5 MB/s eta 0:00:02
   -------------------------- ------------- 7.6/11.6 MB 2.5 MB/s eta 0:00:02
   -------------------------- ------------- 7.7/11.6 MB 2.5 MB/s eta 0:00:02
   -------------------------- ------------- 7.8/11.6 MB 2.5 MB/s eta 0:00:02
   --------------------------- ------------ 7.9/11.6 MB 2.5 MB/s eta 0:00:02
   --------------------------- ------------ 8.0/11.6 MB 2.5 MB/s eta 0:00:02
   --------------------------- ------------ 8.1/11.6 MB 2.5 MB/s eta 0:00:02
   ---------------------------- ----------- 8.2/11.6 MB 2.5 MB/s eta 0:00:02
   ---------------------------- ----------- 8.3/11.6 MB 2.5 MB/s eta 0:00:02
   ---------------------------- ----------- 8.3/11.6 MB 2.5 MB/s eta 0:00:02
   ----------------------------- ---------- 8.4/11.6 MB 2.5 MB/s eta 0:00:02
   ----------------------------- ---------- 8.5/11.6 MB 2.4 MB/s eta 0:00:02
   ------------------------------ --------- 8.8/11.6 MB 2.5 MB/s eta 0:00:02
   ------------------------------ --------- 9.0/11.6 MB 2.5 MB/s eta 0:00:02
   -------------------------------- ------- 9.4/11.6 MB 2.6 MB/s eta 0:00:01
   --------------------------------- ------ 9.7/11.6 MB 2.6 MB/s eta 0:00:01
   ---------------------------------- ----- 10.0/11.6 MB 2.7 MB/s eta 0:00:01
   ----------------------------------- ---- 10.2/11.6 MB 2.7 MB/s eta 0:00:01
   ------------------------------------ --- 10.5/11.6 MB 2.8 MB/s eta 0:00:01
   ------------------------------------- -- 10.8/11.6 MB 2.8 MB/s eta 0:00:01
   -------------------------------------- - 11.0/11.6 MB 2.8 MB/s eta 0:00:01
   ---------------------------------------  11.5/11.6 MB 2.9 MB/s eta 0:00:01
   ---------------------------------------  11.6/11.6 MB 2.9 MB/s eta 0:00:01
   ---------------------------------------- 11.6/11.6 MB 2.9 MB/s eta 0:00:00
Downloading pytz-2024.1-py2.py3-none-any.whl (505 kB)
   ---------------------------------------- 0.0/505.5 kB ? eta -:--:--
   ------------------------------ --------- 389.1/505.5 kB 8.1 MB/s eta 0:00:01
   ---------------------------------------- 505.5/505.5 kB 6.3 MB/s eta 0:00:00
Downloading tzdata-2024.1-py2.py3-none-any.whl (345 kB)
   ---------------------------------------- 0.0/345.4 kB ? eta -:--:--
   --------------------------------------  337.9/345.4 kB 10.6 MB/s eta 0:00:01
   ---------------------------------------- 345.4/345.4 kB 5.4 MB/s eta 0:00:00
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.2 pytz-2024.1 tzdata-2024.1

In [4]:
dict1 ={'Name':['Priyang','Aadhya','Krisha','Vedant','Parshv',
                'Mittal','Archana'],
                'Marks':[98,89,99,87,90,83,99],
                'Gender':['Male','Female','Female','Male','Male',
                         'Female','Female']
               }
df1=pd.DataFrame(dict1)
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## 1. Display Top 3 Rows of The Dataset

In [5]:
df1.head()

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male

In [7]:
df1.head(4)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male

## 2. Check Last 3 Rows of The Dataset

In [10]:
df1.tail()

      Name  Marks  Gender
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## 3. Find Shape of Our Dataset (Number of Rows & Number of Columns)

In [11]:
df1.shape

(7, 3)

In [14]:
print('Number of Rows', df1.shape[0])
print('Number of Columns', df1.shape[1])

Number of Rows 7
Number of Columns 3

## 4. Get Information About Our Dataset Like Total Number Rows, Total Number of Columns, Datatypes of Each Column And Memory Requirement

In [15]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Marks   7 non-null      int64
 2   Gender  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 184.0+ bytes

## 5. Check Null Values in The Dataset

In [16]:
df1.isnull()

    Name  Marks  Gender
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [17]:
df1.isnull().sum()

Name      0
Marks     0
Gender    0
dtype: int64

In [19]:
df1.isnull().sum(axis=1)

0    0
1    0
2    0
3    0
4    0
5    0
6    0
dtype: int64

In [20]:
df1.isnull().sum(axis=0)

Name      0
Marks     0
Gender    0
dtype: int64

## 6. Get Overall Statistics About The Dataframe

In [21]:
df1.describe()

           Marks
count   7.000000
mean   92.142857
std     6.491753
min    83.000000
25%    88.000000
50%    90.000000
75%    98.500000
max    99.000000

In [23]:
df1.describe(include='all')

           Name      Marks  Gender
count         7   7.000000       7
unique        7        NaN       2
top     Priyang        NaN  Female
freq          1        NaN       4
mean        NaN  92.142857     NaN
std         NaN   6.491753     NaN
min         NaN  83.000000     NaN
25%         NaN  88.000000     NaN
50%         NaN  90.000000     NaN
75%         NaN  98.500000     NaN
max         NaN  99.000000     NaN

## 7. Find Unique Values From The Gender Column

In [24]:
df1['Gender'].unique()

array(['Male', 'Female'], dtype=object)

## 8. Find the Number of Unique values from the Gender column

In [25]:
df1['Gender'].nunique()

2

## 9. Display Count of Unique Values in Gender Column

In [27]:
df1['Gender'].value_counts()

Female    4
Male      3
Name: Gender, dtype: int64

## 10. Find Total Number of Students Having Marks Between 90 to 100 (inclusive) using Between Method

In [28]:
df1['Marks']>=90

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [29]:
df1[df1['Marks']>=90]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [33]:
(df1['Marks']>=90) & (df1['Marks']<=100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [34]:
df1[(df1['Marks']>=90) & (df1['Marks']<=100)]

      Name  Marks  Gender
0  Priyang     98    Male
2   Krisha     99  Female
4   Parshv     90    Male
6  Archana     99  Female

In [35]:
len(df1[(df1['Marks']>=90) & (df1['Marks']<=100)])

4

In [38]:
df1['Marks'].between(90,100)

0     True
1    False
2     True
3    False
4     True
5    False
6     True
Name: Marks, dtype: bool

In [39]:
sum(df1['Marks'].between(90,100))

4

## 11. Find Average Marks

In [41]:
df1['Marks'].mean()

92.14285714285714

In [42]:
df1['Marks'].max()

99

## 12. Apply Method

In [43]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [48]:
def marks(x):
    return x//2

In [49]:
df1['Marks'].apply(marks)

0    49
1    44
2    49
3    43
4    45
5    41
6    49
Name: Marks, dtype: int64

In [50]:
df1['Half_marks']=df1['Marks'].apply(marks)

In [51]:
df1

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [52]:
df1['Marks'].apply(lambda x:x/2)

0    49.0
1    44.5
2    49.5
3    43.5
4    45.0
5    41.5
6    49.5
Name: Marks, dtype: float64

In [53]:
df1['Name'].apply(len)

0    7
1    6
2    6
3    6
4    6
5    6
6    7
Name: Name, dtype: int64

## 13. Map Function

In [55]:
df1['Gender'].map({'Male':1, 'Female':0})

0    1
1    0
2    0
3    1
4    1
5    0
6    0
Name: Gender, dtype: int64

In [56]:
df1['Male_Female']=df1['Gender'].map({'Male':1, 'Female':0})

In [57]:
df1

      Name  Marks  Gender  Half_marks  Male_Female
0  Priyang     98    Male          49            1
1   Aadhya     89  Female          44            0
2   Krisha     99  Female          49            0
3   Vedant     87    Male          43            1
4   Parshv     90    Male          45            1
5   Mittal     83  Female          41            0
6  Archana     99  Female          49            0

## 14. Drop the Column (s)

In [58]:
df1.drop('Male_Female',axis=1)

      Name  Marks  Gender  Half_marks
0  Priyang     98    Male          49
1   Aadhya     89  Female          44
2   Krisha     99  Female          49
3   Vedant     87    Male          43
4   Parshv     90    Male          45
5   Mittal     83  Female          41
6  Archana     99  Female          49

In [61]:
df1.drop('Half_marks', axis=1)

      Name  Marks  Gender  Male_Female
0  Priyang     98    Male            1
1   Aadhya     89  Female            0
2   Krisha     99  Female            0
3   Vedant     87    Male            1
4   Parshv     90    Male            1
5   Mittal     83  Female            0
6  Archana     99  Female            0

In [63]:
df1.drop(['Male_Female','Half_marks'], axis=1)

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

In [67]:
df1.drop(['Male_Female','Half_marks'], axis=1, inplace=True)

<class 'KeyError'>: "['Male_Female', 'Half_marks'] not found in axis"

In [65]:
df1

      Name  Marks  Gender
0  Priyang     98    Male
1   Aadhya     89  Female
2   Krisha     99  Female
3   Vedant     87    Male
4   Parshv     90    Male
5   Mittal     83  Female
6  Archana     99  Female

## 15. Print Name of the Columns

In [68]:
df1.columns

Index(['Name', 'Marks', 'Gender'], dtype='object')

In [69]:
df1.index

RangeIndex(start=0, stop=7, step=1)

## 16. Sort the Dataframe As Per The Marks Column

In [70]:
df1.sort_values(by='Marks')

      Name  Marks  Gender
5   Mittal     83  Female
3   Vedant     87    Male
1   Aadhya     89  Female
4   Parshv     90    Male
0  Priyang     98    Male
2   Krisha     99  Female
6  Archana     99  Female

In [71]:
df1.sort_values(by='Marks', ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

In [72]:
df1.sort_values(by=['Marks', 'Gender'], ascending=False)

      Name  Marks  Gender
2   Krisha     99  Female
6  Archana     99  Female
0  Priyang     98    Male
4   Parshv     90    Male
1   Aadhya     89  Female
3   Vedant     87    Male
5   Mittal     83  Female

## 17. Display Name & Marks of The Female Students

In [74]:
df1['Gender']=='Female'

0    False
1     True
2     True
3    False
4    False
5     True
6     True
Name: Gender, dtype: bool

In [76]:
df1[df1['Gender']=='Female']

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female

In [77]:
df1[df1['Gender']=='Female'][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99

In [78]:
df1['Gender'].isin(['Female'])

0    False
1     True
2     True
3    False
4    False
5     True
6     True
Name: Gender, dtype: bool

In [79]:
df1[df1['Gender'].isin(['Female'])]

      Name  Marks  Gender
1   Aadhya     89  Female
2   Krisha     99  Female
5   Mittal     83  Female
6  Archana     99  Female

In [80]:
df1[df1['Gender'].isin(['Female'])][['Name','Marks']]

      Name  Marks
1   Aadhya     89
2   Krisha     99
5   Mittal     83
6  Archana     99